export default {
  "zh-Hant": {
    button: {
      shop: "商店",
      fight: "戰鬥",
      confirm: "確定",
      cancel: "取消",
    },
    popup: {
      allwin: {
        title: "大獲全勝",
        content: "重新開始",
      },
      win: {
        title: "獲勝",
        content: "前往下一關",
      },
      fail: {
        title: "失敗",
        content: "重新開始",
      },
      notMoney: {
        title: "提醒",
        content: "玩家金額不足",
      },
      chessFull: {
        title: "提醒",
        content: "棋子已滿",
      },
    },
    manual: {
      title: "遊戲說明",
      content1:
        "遊戲總共關卡為20關，棋子在戰場上死亡則不會復活，戰鬥結束後受傷棋子可恢復所受傷害的50%。每回合戰鬥結束可獲得100金幣，購買棋子需要20金幣，刷新商店需要10金幣。若要將棋子售出，將棋子移至商店欄位即賣出。(等級2以上販售價格為棋子 X 0.8)。擁有三個相同等級與兵種即可合成，並恢復生命值。攻擊力與血量也會獲得加成，棋子滿等為三等。到達第五關時，可選擇棋子為10個，可購買弓箭手、火槍手、弓騎兵。到達第十關，可購買刺客、戰鼓者、醫療兵。",
      content2:
        "兵種相剋，若遇到兵種相剋則傷害加倍。以下為兵種相剋騎兵 -> 盾兵，盾兵 -> 槍兵，槍兵 -> 騎兵，弓箭手 -> 火槍手、槍兵，火槍手 -> 弓騎兵、騎兵，弓騎兵 -> 弓箭手、盾兵。例: 盾兵被騎兵、弓騎兵攻擊時，承受傷害加倍",
      content3:
        "以下為特殊單位：刺客：每次有單位攻擊時則追加刺客傷害。戰鼓者：輪到戰鼓者攻擊時，提升所有單位攻擊力 X 1.15 (隨著等級累進0.15倍，最多四次)。醫療兵：輪到醫療兵攻擊時，恢復所有單位血量 (隨著等級恢復 20、50、80 血量)",
    },
    other: {
      userMoney: "玩家金額:",
    },
  },
};
